benchmark/results/v0.6/throughput_mc-vs-rust/RAW/hyper-plaintext-throughput_mc-cal-213811.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.58ms    3.52ms  88.00ms   98.11%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.23ms
 75.000%    1.64ms
 90.000%    2.03ms
 99.000%    9.03ms
 99.900%   66.30ms
 99.990%   81.15ms
 99.999%   86.14ms
100.000%   88.06ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.028     0.000000            1         1.00
       0.611     0.100000       212491         1.11
       0.791     0.200000       424281         1.25
       0.935     0.300000       637774         1.43
       1.075     0.400000       849825         1.67
       1.226     0.500000      1061337         2.00
       1.303     0.550000      1167562         2.22
       1.382     0.600000      1273222         2.50
       1.465     0.650000      1379165         2.86
       1.552     0.700000      1485870         3.33
       1.644     0.750000      1591788         4.00
       1.693     0.775000      1644324         4.44
       1.746     0.800000      1697646         5.00
       1.803     0.825000      1750742         5.71
       1.866     0.850000      1803784         6.67
       1.938     0.875000      1856463         8.00
       1.980     0.887500      1883169         8.89
       2.026     0.900000      1909562        10.00
       2.077     0.912500      1936381        11.43
       2.135     0.925000      1962737        13.33
       2.217     0.937500      1989046        16.00
       2.279     0.943750      2002254        17.78
       2.357     0.950000      2015176        20.00
       2.465     0.956250      2028595        22.86
       2.615     0.962500      2041818        26.67
       2.857     0.968750      2054965        32.00
       3.087     0.971875      2061602        35.56
       3.509     0.975000      2068213        40.00
       4.207     0.978125      2074830        45.71
       5.143     0.981250      2081457        53.33
       6.339     0.984375      2088088        64.00
       7.047     0.985938      2091398        71.11
       7.819     0.987500      2094733        80.00
       8.575     0.989062      2098044        91.43
       9.351     0.990625      2101370       106.67
      10.327     0.992188      2104666       128.00
      10.959     0.992969      2106329       142.22
      11.663     0.993750      2107980       160.00
      12.511     0.994531      2109635       182.86
      13.719     0.995313      2111288       213.33
      18.735     0.996094      2112943       256.00
      23.999     0.996484      2113773       284.44
      30.399     0.996875      2114600       320.00
      39.039     0.997266      2115429       365.71
      47.711     0.997656      2116257       426.67
      53.983     0.998047      2117085       512.00
      56.511     0.998242      2117499       568.89
      58.815     0.998437      2117919       640.00
      61.151     0.998633      2118329       731.43
      63.743     0.998828      2118744       853.33
      66.751     0.999023      2119163      1024.00
      68.223     0.999121      2119364      1137.78
      70.143     0.999219      2119580      1280.00
      71.743     0.999316      2119779      1462.86
      73.407     0.999414      2119992      1706.67
      74.751     0.999512      2120195      2048.00
      75.327     0.999561      2120296      2275.56
      76.095     0.999609      2120402      2560.00
      76.927     0.999658      2120506      2925.71
      77.631     0.999707      2120608      3413.33
      78.463     0.999756      2120714      4096.00
      78.783     0.999780      2120763      4551.11
      79.167     0.999805      2120813      5120.00
      79.743     0.999829      2120871      5851.43
      80.191     0.999854      2120917      6826.67
      80.639     0.999878      2120971      8192.00
      80.831     0.999890      2120995      9102.22
      81.215     0.999902      2121021     10240.00
      81.471     0.999915      2121046     11702.86
      81.791     0.999927      2121075     13653.33
      81.983     0.999939      2121098     16384.00
      82.175     0.999945      2121112     18204.44
      82.431     0.999951      2121126     20480.00
      82.623     0.999957      2121141     23405.71
      82.751     0.999963      2121152     27306.67
      83.071     0.999969      2121163     32768.00
      83.391     0.999973      2121172     36408.89
      83.775     0.999976      2121176     40960.00
      84.031     0.999979      2121183     46811.43
      84.543     0.999982      2121189     54613.33
      84.991     0.999985      2121195     65536.00
      85.119     0.999986      2121198     72817.78
      85.631     0.999988      2121202     81920.00
      85.951     0.999989      2121205     93622.86
      86.143     0.999991      2121208    109226.67
      86.399     0.999992      2121212    131072.00
      86.655     0.999993      2121213    145635.56
      86.847     0.999994      2121215    163840.00
      86.911     0.999995      2121217    187245.71
      87.103     0.999995      2121218    218453.33
      87.231     0.999996      2121219    262144.00
      87.295     0.999997      2121220    291271.11
      87.359     0.999997      2121222    327680.00
      87.359     0.999997      2121222    374491.43
      87.487     0.999998      2121223    436906.67
      87.487     0.999998      2121223    524288.00
      87.615     0.999998      2121225    582542.22
      87.615     0.999998      2121225    655360.00
      87.615     0.999999      2121225    748982.86
      87.615     0.999999      2121225    873813.33
      87.615     0.999999      2121225   1048576.00
      87.743     0.999999      2121226   1165084.44
      87.743     0.999999      2121226   1310720.00
      87.743     0.999999      2121226   1497965.71
      87.743     0.999999      2121226   1747626.67
      87.743     1.000000      2121226   2097152.00
      88.063     1.000000      2121227   2330168.89
      88.063     1.000000      2121227          inf
#[Mean    =        1.580, StdDeviation   =        3.520]
#[Max     =       88.000, Total count    =      2121227]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2121237 requests in 10.00s, 262.99MB read
Requests/sec: 212134.35
Transfer/sec:     26.30MB