benchmark/results/v0.6/throughput_mc-vs-rust/RAW/hyper-plaintext-throughput_mc-run5.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread calibration: mean lat.: 1.299ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.291ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.306ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.310ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.292ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.301ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.275ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.295ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.28ms  578.43us   6.34ms   67.39%
    Req/Sec    25.98k     1.76k   32.00k    70.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.24ms
 75.000%    1.65ms
 90.000%    2.05ms
 99.000%    2.83ms
 99.900%    3.28ms
 99.990%    3.84ms
 99.999%    5.38ms
100.000%    6.34ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.029     0.000000            1         1.00
       0.567     0.100000       391766         1.11
       0.749     0.200000       781301         1.25
       0.910     0.300000      1172225         1.43
       1.078     0.400000      1562653         1.67
       1.240     0.500000      1953113         2.00
       1.319     0.550000      2148787         2.22
       1.398     0.600000      2344526         2.50
       1.478     0.650000      2540296         2.86
       1.560     0.700000      2733807         3.33
       1.649     0.750000      2928791         4.00
       1.697     0.775000      3026660         4.44
       1.749     0.800000      3124082         5.00
       1.807     0.825000      3221754         5.71
       1.873     0.850000      3319679         6.67
       1.950     0.875000      3417789         8.00
       1.994     0.887500      3465792         8.89
       2.045     0.900000      3515139        10.00
       2.101     0.912500      3564100        11.43
       2.165     0.925000      3613100        13.33
       2.241     0.937500      3661324        16.00
       2.285     0.943750      3685717        17.78
       2.333     0.950000      3710266        20.00
       2.383     0.956250      3734091        22.86
       2.441     0.962500      3759115        26.67
       2.503     0.968750      3783083        32.00
       2.539     0.971875      3795651        35.56
       2.577     0.975000      3807854        40.00
       2.617     0.978125      3819685        45.71
       2.661     0.981250      3831738        53.33
       2.713     0.984375      3844192        64.00
       2.741     0.985938      3850172        71.11
       2.771     0.987500      3856201        80.00
       2.805     0.989062      3862244        91.43
       2.845     0.990625      3868536       106.67
       2.887     0.992188      3874512       128.00
       2.911     0.992969      3877549       142.22
       2.937     0.993750      3880643       160.00
       2.965     0.994531      3883583       182.86
       2.999     0.995313      3886652       213.33
       3.037     0.996094      3889795       256.00
       3.057     0.996484      3891277       284.44
       3.079     0.996875      3892791       320.00
       3.103     0.997266      3894342       365.71
       3.127     0.997656      3895802       426.67
       3.159     0.998047      3897359       512.00
       3.175     0.998242      3898028       568.89
       3.197     0.998437      3898841       640.00
       3.221     0.998633      3899579       731.43
       3.251     0.998828      3900351       853.33
       3.283     0.999023      3901077      1024.00
       3.303     0.999121      3901477      1137.78
       3.325     0.999219      3901858      1280.00
       3.351     0.999316      3902228      1462.86
       3.383     0.999414      3902610      1706.67
       3.423     0.999512      3902997      2048.00
       3.443     0.999561      3903175      2275.56
       3.469     0.999609      3903368      2560.00
       3.499     0.999658      3903566      2925.71
       3.533     0.999707      3903746      3413.33
       3.577     0.999756      3903941      4096.00
       3.601     0.999780      3904037      4551.11
       3.629     0.999805      3904130      5120.00
       3.669     0.999829      3904229      5851.43
       3.715     0.999854      3904322      6826.67
       3.775     0.999878      3904415      8192.00
       3.809     0.999890      3904462      9102.22
       3.851     0.999902      3904509     10240.00
       3.917     0.999915      3904558     11702.86
       4.007     0.999927      3904605     13653.33
       4.131     0.999939      3904652     16384.00
       4.199     0.999945      3904676     18204.44
       4.299     0.999951      3904700     20480.00
       4.379     0.999957      3904724     23405.71
       4.463     0.999963      3904747     27306.67
       4.603     0.999969      3904771     32768.00
       4.643     0.999973      3904783     36408.89
       4.707     0.999976      3904796     40960.00
       4.791     0.999979      3904808     46811.43
       4.891     0.999982      3904819     54613.33
       5.027     0.999985      3904831     65536.00
       5.119     0.999986      3904837     72817.78
       5.199     0.999988      3904843     81920.00
       5.323     0.999989      3904849     93622.86
       5.459     0.999991      3904855    109226.67
       5.671     0.999992      3904861    131072.00
       5.735     0.999993      3904864    145635.56
       5.755     0.999994      3904867    163840.00
       5.811     0.999995      3904870    187245.71
       5.847     0.999995      3904873    218453.33
       5.915     0.999996      3904876    262144.00
       5.919     0.999997      3904877    291271.11
       5.991     0.999997      3904879    327680.00
       6.075     0.999997      3904880    374491.43
       6.099     0.999998      3904882    436906.67
       6.139     0.999998      3904883    524288.00
       6.163     0.999998      3904884    582542.22
       6.187     0.999998      3904885    655360.00
       6.187     0.999999      3904885    748982.86
       6.199     0.999999      3904886    873813.33
       6.235     0.999999      3904887   1048576.00
       6.235     0.999999      3904887   1165084.44
       6.267     0.999999      3904888   1310720.00
       6.267     0.999999      3904888   1497965.71
       6.267     0.999999      3904888   1747626.67
       6.331     1.000000      3904889   2097152.00
       6.331     1.000000      3904889   2330168.89
       6.331     1.000000      3904889   2621440.00
       6.331     1.000000      3904889   2995931.43
       6.331     1.000000      3904889   3495253.33
       6.339     1.000000      3904890   4194304.00
       6.339     1.000000      3904890          inf
#[Mean    =        1.280, StdDeviation   =        0.578]
#[Max     =        6.336, Total count    =      3904890]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5866627 requests in 30.00s, 727.33MB read
Requests/sec: 195554.29
Transfer/sec:     24.24MB